# ReferenceToLocalFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExternalResourceReferenceFailures..::..ReferenceToLocalFile Property
BuiltInFailures..::..ExternalResourceReferenceFailures Class See Also
---
The External Resource refers to a local file that may not be available to workshared users.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReferenceToLocalFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceToLocalFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReferenceToLocalFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ExternalResourceReferenceFailures Class
Autodesk.Revit.DB Namespace